export const navbarItems = [
  {
    name: "Начало",
    href: "/"
  },
  {
    name: "За мен",
    href: "/about"
  },
  {
    name: "Услуги",
    href: "/services"
  },
  {
    name: "Галерия",
    href: "/gallery"
  },
  {
    name: "Контакти",
    href: "/contacts"
  }
];

export const servicesItems = [
  {
    title: "Претапициране на столове",
    description:
      "Вашите любими столове са износени, скъсани или просто не пасват на интериора? С услугата ни за претапициране на столове можете да им придадете напълно нов облик! Ние предлагаме широка гама от висококачествени дамаски, еко и естествена кожа, които ще преобразят вашите мебели и ще им осигурят дълготрайна издръжливост.",
    steps: [
      "Смяна на дамаската с материал по ваш избор",
      "Подмяна на дунапрена за по-голям комфорт",
      "Заздравяване на конструкцията при необходимост",
      "Висококачествена изработка и внимание към детайла",
    ],
    endMessage: "Свържете се с нас за консултация и оферта."
  },
  {
    title: "Тапициране на фотьойли",
    description:
      "Любимият ви фотьойл е износен, скъсан или просто не подхожда на новия ви интериор? Вместо да го заменяте, дайте му втори живот с професионалното ни тапициране на фотьойли!",
    steps: [
      "Смяна на дамаската – богат избор от текстил, еко и естествена кожа",
      "Подмяна на дунапрена – за повече комфорт и удобство",
      "Освежаване на конструкцията – поправка и заздравяване при нужда",
      "Прецизна изработка – внимание към всеки детайл",
    ],
    endMessage: "Насладете се отново на уюта и елегантността на вашия фотьойл! Свържете се с нас за консултация и индивидуална оферта. 😊"
  },
];

export const env = {
  WEBSITE_TITLE: String(process.env.WEBSITE_TITLE),
}

export const LOGO_IMAGE = "/light.svg";
export const LOGO_DARK_IMAGE = "/dark.svg";
