export interface AboutPageCarouselItem {
  title: string;
  content: string;
}

export interface AboutHeader {
  title: string;
  content: string;
}

export const getAboutHeader = async () => {
  const title = "За мен";
  const content = `
    <p>Казвам се Костадин Костадинов и с гордост мога да кажа, че вече 10 години се занимавам с ремонта, претапицирането и реставрацията на мека мебел. В течение на годините съм натрупал богат опит и съм се усъвършенствал в различни техники и подходи, които ми позволяват да предлагам най-доброто качество на своите клиенти.</p>

    <p>Всеки проект, който поемам, е индивидуален и уникален, като обръщам внимание на всеки детайл, защото знам колко важни са те за крайния резултат. Работя само с висококачествени материали, които гарантират не само естетическа привлекателност, но и дълготрайност на мебелите. Моята основна цел е да създам мебели, които не само изглеждат добре, но също така са удобни и функционални, и които перфектно се вписват в интериора на вашия дом или офис.</p>

    <p>Независимо дали става въпрос за реставрация на стар мебел, или създаване на нови, стилни решения, аз съм тук, за да изпълня всички ваши изисквания и да ви помогна да получите мебелите, които наистина желаете.</p>`;

  return {
    title,
    content,
  };
};

export const getCarouselInfo = async () => {
  const carouselItems: AboutPageCarouselItem[] = [
    {
      title: "Опит в индустрията",
      content:
        "През годините съм работил по разнообразни проекти – от реставрация на антикварни мебели до модерни решения за съвременни интериори. Моят опит ми позволява да предложа прецизно изпълнение и дълготрайни резултати, които отговарят на високите изисквания на клиентите.",
    },
    {
      title: "Индивидуален подход",
      content:
        "Разбирам, че всяко пространство и мебел имат своя уникалност. Затова предоставям персонализирани решения, които напълно отговарят на вашите нужди и предпочитания. От избора на материали до дизайна на тапицерията, всяка част от процеса е внимателно съобразена с вашия стил и функционалност. Моята цел е да създам мебели, които не само да изглеждат чудесно, но и да се впишат перфектно в дома или офиса ви.",
    },
    {
      title: "Качество на достъпни цени",
      content:
        "Предлагам високо качество на услугите си, без да правя компромис с материалите и изпълнението, но същевременно се старая да поддържам конкурентни и справедливи цени. Вярвам, че доброто тапицерство не трябва да бъде скъпо, затова предлагам персонализирани решения, които да отговорят на вашите изисквания, без да натоварват бюджета ви. С мен получавате отлично съотношение между цена и качество.",
    },
  ];
  const delay = 10;

  return {
    carouselItems,
    delay,
    isAutoPlay: true,
  };
};
