import { getSettings } from "@/app/dashboard/settings/data";
import { formatDate } from "@/lib/utils";

const heading = "font-semibold text-2xl";
const ulList = "ml-10 list-decimal flex flex-col gap-2";

export default async function PrivacyPolicy() {
  const settings = await getSettings();

  return (
    <main className="container mx-auto px-5 py-5 sm:py-10">
      <h1 className="mb-5 sm:mb-10 font-semibold text-2xl text-center">
        Политиката за поверителност
      </h1>
      <div className="bg-white border rounded space-y-5 p-5 sm:p-10">
        <p>
          Тази политика важи за всички посетители на нашия уебсайт, както и за
          всички потребители, които взаимодействат с него. С използването на нашия
          сайт, Вие се съгласявате с практиките, описани в тази Политика за
          поверителност.
        </p>
        <h2 className={heading}>1. Лична информация</h2>
        <ul className={ulList}>
          <li>
            <strong>Не събираме лични данни:</strong>
            <p>
              Нашият уебсайт не извършва автоматично събиране, обработка или
              съхранение на лични данни като име, имейл адрес, телефонен номер,
              адрес или друга информация, която би могла да Ви идентифицира.
            </p>
          </li>
          <li>
            <strong>Доброволно предоставяне на информация:</strong>
            <p>
              В случай, че решите доброволно да споделите лична информация чрез
              специално създадени форми (например, чрез контактна форма), тази
              информация ще бъде използвана единствено за целите, за които е
              предоставена (като отговор на запитване или предоставяне на
              информация за услугите ни). Обърнете внимание, че такива ситуации
              са изключение и не са част от рутинното функциониране на нашия
              сайт.
            </p>
          </li>
        </ul>
        <h2 className={heading}>2. Използване на бисквитки</h2>
        <p>
          Нашият уебсайт използва само необходимите бисквитки, които са от
          съществено значение за правилната работа и функционалността на сайта.
          Те не събират никаква лична информация и служат за поддържане на
          сесията на потребителя и осигуряване на гладко потребителско
          изживяване. Подробна информация за използваните бисквитки може да
          намерите в нашата{" "}
          <a href="/cookie-policy" className="text-primary">
            Политика за бисквитките
          </a>
          .
        </p>
        <h2 className={heading}>3. Трети страни</h2>
        <ul className={ulList}>
          <li>
            <strong>Връзки към други уебсайтове:</strong>
            <p>
              Нашият уебсайт може да съдържа връзки към други уебсайтове, които
              не са под контрола на {settings.companyData?.websiteTitle}. Ние не
              носим отговорност за практиките по поверителност на тези сайтове и
              Ви препоръчваме да прегледате техните политики за поверителност
              при посещение.
            </p>
          </li>
          <li>
            <strong>Услуги от външни доставчици:</strong>
            <p>
              В случай, че някога използваме външни услуги (например за хостинг
              или анализ), ще се уверим, че доставчиците спазват съответните
              стандарти за защита на данните. Все пак, тъй като не събираме
              лични данни, тази ситуация е минимална.
            </p>
          </li>
        </ul>
        <h2 className={heading}>4. Сигурност на данните</h2>
        <p>
          Ние предприемаме технически и организационни мерки, за да осигурим
          сигурността на информацията, дори ако тя не включва лични данни.
          Нашата цел е да защитим целостта и наличността на данните, с които
          работим, и да предотвратим неоторизиран достъп или разкриване.
        </p>
        <h2 className={heading}>5. Права на потребителите</h2>
        <p>
          Понеже не събираме лични данни, въпросите, свързани с достъпа,
          корекцията или изтриването на лична информация, не са приложими. Ако
          обаче имате въпроси относно тази Политика за поверителност или
          практиките ни по отношение на личните данни, моля, не се колебайте да
          се свържете с <a href="/contacts" className="text-primary">нас</a>.
        </p>
        <h2 className={heading}>6. Промени в Политиката за поверителност</h2>
        <p>
          Ние си запазваме правото да актуализираме тази Политика за
          поверителност по всяко време, като публикуваме актуализираната версия
          на тази страница. Препоръчваме Ви периодично да проверявате тази
          страница, за да сте информирани за последните промени.
        </p>
        <h2 className={heading}>7. Информация за контакти</h2>
        <ul className={ulList}>
          <li>Имейл: {settings.companyData?.emailAddress}</li>
          <li>Телефон: {settings.companyData?.phoneNumber}</li>
          <li>Адрес: {settings.companyData?.physicalAddress}</li>
        </ul>
        <p>
          С използването на нашия уебсайт, Вие се съгласявате с условията,
          описани в тази Политика за поверителност. Ако не сте съгласни с нея,
          моля, въздържайте се от използването на нашия сайт или се свържете с
          нас за допълнителна информация.
        </p>
      </div>
    </main>
  );
}