import { getSettings } from "@/app/dashboard/settings/data";
import { formatDate } from "@/lib/utils";

const heading = "font-semibold text-2xl";
const ulList = "ml-10 list-decimal flex flex-col gap-2";

export default async function PrivacyPolicy() {
  const settings = await getSettings();

  return (
    <main className="container mx-auto px-5 py-5 sm:py-10">
      <h1 className="mb-5 sm:mb-10 font-semibold text-2xl text-center">
        Общи условия
      </h1>
      <div className="bg-white border rounded space-y-5 p-5 sm:p-10">
        <p>
          Последна актуализация:{" "}
          {settings.companyData?.updatedAt &&
            formatDate(settings.companyData?.updatedAt)}
        </p>
        <p>
          Тези Общи условия уреждат използването на уебсайта на{" "}
          {settings.companyData?.websiteTitle} („ние“, „нашият/наша“). Моля,
          прочетете внимателно тези условия, преди да използвате нашия уебсайт
          за тапицерски услуги. С достъпа до и използването на нашия уебсайт,
          вие се съгласявате с настоящите Общи условия. Ако не сте съгласни с
          някоя от частите им, моля, въздържайте се от използването на сайта.
        </p>
        <h2 className={heading}>1. Въведение</h2>
        <ul className={ulList}>
          <li>
            Този уебсайт предоставя информация за тапицерски услуги, които
            предлагаме.
          </li>
          <li>
            Ние се стремим да осигурим точна и актуална информация, но не можем
            да гарантираме пълнотата, точността или актуалността на
            съдържанието.
          </li>
        </ul>
        <h2 className={heading}>2. Приемане на условията</h2>
        <ul className={ulList}>
          <li>
            С достъпа и използването на нашия уебсайт, вие автоматично се
            съгласявате с настоящите Общи условия.
          </li>
          <li>
            Запазваме правото да променяме или актуализираме тези условия по
            всяко време, като промените ще бъдат публикувани на тази страница.
            Препоръчваме ви редовно да проверявате за актуализации.
          </li>
        </ul>
        <h2 className={heading}>3. Интелектуална собственост</h2>
        <ul className={ulList}>
          <li>
            Всички текстове, изображения, графики, лога, видео материали и друг
            тип съдържание, публикувано на този уебсайт, са собственост на{" "}
            {settings.companyData?.websiteTitle} или на техните уважавани
            притежатели на авторски права.
          </li>
          <li>
            Забранява се копирането, възпроизвеждането или използването на
            съдържанието без изричното писмено съгласие от наша страна, освен
            ако не е изрично разрешено от закона.
          </li>
        </ul>
        <h2 className={heading}>4. Условия за използване на сайта</h2>
        <ul className={ulList}>
          <li>
            <strong>Достъп и използване:</strong>
            <p>
              Използването на уебсайта е позволено за лични, некомерсиални цели.
              Забранено е използването му за каквито и да е незаконни или
              неразрешени цели.
            </p>
          </li>
          <li>
            <strong>Промени в съдържанието:</strong>
            <p>
              Въпреки че се стремим съдържанието да бъде актуално и точно, не
              носим отговорност за грешки или пропуски. Съдържанието може да
              бъде променяно без предварително уведомление.
            </p>
          </li>
          <li>
            <strong>Потребителско съдържание:</strong>
            <p>
              В случай че има възможност за публикуване на коментари, мнения или
              друга форма на потребителско съдържание, вие гарантирате, че то
              няма да съдържа обидна, незаконна, дискриминационна или по друг
              начин неподходяща информация. Ние си запазваме правото да
              премахваме всяко съдържание, което смятаме за неподходящо.
            </p>
          </li>
        </ul>
        <h2 className={heading}>5. Ограничаване на отговорността</h2>
        <ul className={ulList}>
          <li>
            <strong>Без гаранции:</strong>
            <p>
              Уебсайтът се предоставя &quot;такъв, какъвто е&quot;, без каквито и да е
              изрични или подразбиращи се гаранции. Ние не гарантираме, че
              сайтът ще бъде непрекъснат, без грешки или сигурен от вируси и
              други вредни компоненти.
            </p>
          </li>
          <li>
            <strong>Отказ от отговорност:</strong>
            <p>
              Нито {settings.companyData?.websiteTitle}, нито неговите
              служители, партньори или доставчици не поемат отговорност за
              каквито и да е щети, произтичащи от използването или
              невъзможността за използване на този уебсайт.
            </p>
          </li>
        </ul>
        <h2 className={heading}>6. Връзки към трети страни</h2>
        <ul className={ulList}>
          <li>
            Нашият уебсайт може да съдържа връзки към външни сайтове, които не
            са под контрола на {settings.companyData?.websiteTitle}.
          </li>
          <li>
            Ние не носим отговорност за съдържанието, политиките за
            поверителност или практиките на тези сайтове. Препоръчваме ви да
            прегледате общите условия и политиките за поверителност на всеки
            външен сайт, който посещавате.
          </li>
        </ul>
        <h2 className={heading}>7. Липса на събиране на лични данни</h2>
        <ul className={ulList}>
          <li>
            Нашият уебсайт <strong>не събира лични данни</strong> от
            потребителите, освен в случаите, когато това е изрично посочено и
            доброволно предоставено чрез специални форми (например, контактна
            форма).
          </li>
          <li>
            В случай че доброволно предоставите лична информация, тя ще бъде
            използвана единствено за целите, за които сте я предоставили, и ще
            бъде защитена в съответствие с приложимото законодателство.
          </li>
        </ul>
        <h2 className={heading}>8. Промени в Общите условия</h2>
        <ul>
          <li>
            Ние си запазваме правото да актуализираме или променяме тези Общи
            условия по всяко време.
          </li>
          <li>
            Промените ще влязат в сила веднага след публикуването им на тази
            страница. Вашето продължително използване на сайта след
            публикуването на промените ще се счита за приемане на
            актуализираните условия.
          </li>
        </ul>
        <h2 className={heading}>9. Приложимо право</h2>
        <ul>
          <li>
            Тези Общи условия се уреждат от законодателството на Република
            България.
          </li>
          <li>
            Всички спорове, произтичащи от или свързани с използването на този
            уебсайт, ще се решават изключително от компетентните съдилища в
            Кюстендил и Дупница.
          </li>
        </ul>
        <h2 className={heading}>10. Контактна информация</h2>
        <p>
          Ако имате въпроси, коментари или искания, свързани с тези Общи
          условия, можете да се свържете с нас на:
        </p>
        <ul className={ulList}>
          <li>Имейл: {settings.companyData?.emailAddress}</li>
          <li>Телефон: {settings.companyData?.phoneNumber}</li>
          <li>Адрес: {settings.companyData?.physicalAddress}</li>
        </ul>
        <p>
          С използването на нашия уебсайт, вие се съгласявате с гореописаните
          Общи условия. Ако не сте съгласни с някоя от разпоредбите, моля,
          въздържайте се от използването на сайта.
        </p>
      </div>
    </main>
  );
}